[
  "obsidian-codemirror-options",
  "obsidian-vimrc-support",
  "calendar",
  "url-into-selection",
  "obsidian-pandoc",
  "obsidian-citation-plugin",
  "obsidian-dictionary-plugin",
  "obsidian-admonition",
  "table-editor-obsidian",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-embedded-code-title",
  "obsidian-icons-plugin",
  "obsidian-outliner",
  "pdf-to-markdown-plugin",
  "templater-obsidian",
  "recent-files-obsidian",
  "obsidian-mind-map",
  "obsidian-annotator",
  "obsidian-collapse-all-plugin",
  "nldates-obsidian",
  "convert-url-to-iframe",
  "better-word-count",
  "obsidian-emoji-toolbar",
  "hotkeysplus-obsidian",
  "darlal-switcher-plus",
  "obsidian-show-file-path",
  "obsidian-tidy-footnotes",
  "unique-attachments",
  "obsidian-excalidraw-plugin",
  "sliding-panes-obsidian",
  "obsidian-focus-mode",
  "periodic-notes",
  "obsidian-text-format",
  "obsidian-latex",
  "quick-latex",
  "homepage",
  "find-unlinked-files",
  "obsidian-auto-link-title",
  "ghost-fade-focus",
  "hotkey-helper",
  "key-promoter",
  "metaedit",
  "todoist-sync-plugin",
  "obsidian-embedded-note-titles",
  "obsidian-minimal-settings",
  "obsidian-hider",
  "obsidian-extract-pdf-highlights"
]