[
  "code-block-copy",
  "obsidian-codemirror-options",
  "obsidian-vimrc-support",
  "calendar",
  "url-into-selection",
  "obsidian-pandoc",
  "obsidian-citation-plugin",
  "obsidian-dictionary-plugin",
  "obsidian-kanban",
  "obsidian-admonition",
  "table-editor-obsidian",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-embedded-code-title",
  "obsidian-hider",
  "obsidian-icons-plugin",
  "obsidian-outliner",
  "pdf-to-markdown-plugin",
  "templater-obsidian",
  "dataview",
  "obsidian-tasks-plugin",
  "markdown-prettifier",
  "recent-files-obsidian",
  "file-tree-alternative",
  "remember-cursor-position",
  "obsidian-mind-map",
  "obsidian-annotator",
  "metaedit",
  "obsidian-collapse-all-plugin",
  "nldates-obsidian",
  "convert-url-to-iframe",
  "better-word-count",
  "obsidian-emoji-toolbar",
  "tag-wrangler",
  "hotkeysplus-obsidian",
  "darlal-switcher-plus",
  "obsidian-plugin-toc",
  "obsidian-show-file-path",
  "obsidian-reminder-plugin",
  "obsidian-tidy-footnotes",
  "unique-attachments",
  "buttons",
  "obsidian-excalidraw-plugin",
  "sliding-panes-obsidian",
  "obsidian-focus-mode",
  "vantage-obsidian",
  "periodic-notes",
  "obsidian-text-format",
  "obsidian-latex",
  "quick-latex",
  "obsidian-style-settings"
]